Repository: VityaSchel/samsung-pinger
Catalog: Shared/*.lproj/Localizable.strings
Languages: ru

# settings_label
source: To be able to ping your device, this widget needs your Samsung's SmartThingsFind tokens and Device ID. This information never leaves your computer and won't be shared with anyone. You can review source code at
ru: Чтобы пинговать ваше устройство, этому виджеты нужны токены SmartThingsFind и Device ID. Эти данные никогда не покидают ваш компьютер и никому не передаются. Узнайте больше на

# instructions_label
source: Don't know how to find these values?
ru: Узнайте, как получить значения ниже:

# instructions_link
source: View instructions
ru: Инструкция

# settings_field_ping_text
source: Ping text (optional):
ru: Текст на экране (необязательно):

# settings_field_ping_placeholder
source: Samsung Pinger is ringing this phone!
ru: Samsung Pinger звонит на этот телефон!

# saved_successfully_message
source: Saved successfully!
ru: Успешно сохранено!

# validation_error_message
source: Validation Error
ru: Ошибка валидации

# required_field_error
source: is a required field. If you don't know where to find this token, please refer to instructions in README.md file on GitHub
ru: это обязательное поле. Если вы не знаете, где найти это значение, пожалуйста, обратитесь к инструкции в README.md на GitHub

# device_id_validation_error
source: Device ID must only consist of numbers
ru: Device ID может состоять только из цифр

# ringing_view_connecting
source: Connecting...
ru: Подключение...

# ringing_view_ringing
source: Ringing your Samsung device...
ru: Звонок на устройство...

source: Error
ru: Ошибка

# save_button
source: Save
ru: Сохранить

source: Ring my Samsung
ru: Найти мой Samsung

# widget_name
source: Samsung Pinger Widget
ru: Виджет Samsung Pinger

# widget_description
source: Ping your Samsung device
ru: Пингуйте ваше устройство Samsung
